Revit 2027 API
BuiltInFailures.GeneralFailures.NameIsEmpty Property
 Name is empty
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NameIsEmpty { get; }
Public Shared ReadOnly Property NameIsEmpty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NameIsEmpty {
	FailureDefinitionId^ get ();
}
static member NameIsEmpty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace